EDT/УТ/src/Documents/УстановкаТАВМашины/УстановкаТАВМашины.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаТАВМашины</name>
  <registerRecords>InformationRegister.ТелефонныеАппаратыТранспорта</registerRecords>
  <attributes>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Транспорт</name>
    <attributes>
      <name>Транспорт</name>
      <type>
        <types>CatalogRef.новаТранспорт</types>
      </type>
    </attributes>
    <attributes>
      <name>ТА</name>
      <type>
        <types>CatalogRef.ТелефонныеАппараты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/InformationRegisters/ТелефонныеАппаратыТранспорта/ТелефонныеАппаратыТранспорта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТелефонныеАппаратыТранспорта</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ТА</name>
    <type>
      <types>CatalogRef.ТелефонныеАппараты</types>
    </type>
  </resources>
  <dimensions>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Documents/УстановкаТАВМашины/ObjectModule.bsl
Функция ОбновитьАдминку(Режим)
	Попытка
		ПодключениеКМагазину = Евген.СоздатьПодключениеКИнтернетМагазину(); 
	Исключение
		НормальныйХодВыполнения = Ложь;
		Возврат Ложь;
	КонецПопытки;
	
	
	Если Режим = "Проведение" Тогда
		Для Каждого Тек Из Транспорт Цикл
			МаркаТекст = "";
			Если Не Тек.Транспорт.Марка.Пустая() Тогда
				МаркаТекст = СокрЛП(Тек.Транспорт.Марка.Наименование);
			КонецеСли;	
			
			
			ЗапросКИнтернетМагазину("EXEC pb_UpdateCar '" + СокрЛП(Тек.Транспорт.НомерГосударственнойРегистрации) + "','" + СокрЛП(Тек.ТА.Телефон) + "', 5, 1,'" + МаркаТекст + "'", ПодключениеКМагазину);
			//|UPDATE dbo._car SET phone='" + СокрЛП(Тек.ТА.Телефон) + "'
			//|WHERE carNumber = '" + СокрЛП(Тек.Транспорт.НомерГосударственнойРегистрации) + "'", ПодключениеКМагазину);
			
			//ЗапросКИнтернетМагазину("
		КонецЦикла;	
	ИначеЕсли Режим = "ОтменаПроведения" Тогда
		//Для Каждого Тек Из Транспорт Цикл
		//	Стр = Новый Структура;
		//	
		//	Стр.Вставить("Транспорт", Тек.Транспорт);
		//	
		//	ТА = РегистрыСведений.ТелефонныеАппаратыТранспорта.ПолучитьПоследнее(Дата-1, Стр).ТА;
		//	
		//	Если ЗначениеЗаполнено(ТА) Тогда
		//		ЗапросКИнтернетМагазину("
		//		|UPDATE dbo._car SET phone='" + СокрЛП(ТА.Телефон) + "'
		//		|WHERE carNumber = '" + СокрЛП(Тек.Транспорт.НомерГосударственнойРегистрации) + "'", ПодключениеКМагазину);
		//	Иначе
		//		ЗапросКИнтернетМагазину("
		//		|UPDATE dbo._car SET phone=''
		//		|WHERE carNumber = '" + СокрЛП(Тек.Транспорт.НомерГосударственнойРегистрации) + "'", ПодключениеКМагазину);
		//	КонецеСли;
		//КонецЦикла;	
		
	КонецеСли;
КонецФункции


Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ТелефонныеАппаратыТранспорта
	Движения.ТелефонныеАппаратыТранспорта.Записывать = Истина;
	Движения.ТелефонныеАппаратыТранспорта.Очистить();
	Для Каждого ТекСтрокаТранспорт Из Транспорт Цикл
		Движение = Движения.ТелефонныеАппаратыТранспорта.Добавить();
		Движение.Период = Дата;
		Движение.Транспорт = ТекСтрокаТранспорт.Транспорт;
		Движение.ТА = ТекСтрокаТранспорт.ТА;
	КонецЦикла;
    Движения.ТелефонныеАппаратыТранспорта.Записать();
	
	ОбновитьАдминку("Проведение");
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры



Функция ЗапросКИнтернетМагазину(ТекстЗапроса, ПодключениеКМагазину) Экспорт
	//Сообщить("======= Запрос =======");
	//Сообщить(ТекстЗапроса);
	Cmd = Новый COMОбъект("ADODB.Command");
	Cmd.ActiveConnection = ПодключениеКМагазину;
	Cmd.CommandText = ТекстЗапроса;
	Cmd.CommandType = 1;
	Возврат Cmd.Execute();
КонецФункции // ЗапросКИнтернетМагазину()

Процедура ОбработкаУдаленияПроведения(Отказ)
	ОбновитьАдминку("ОтменаПроведения");	
КонецПроцедуры
